design doc updates
